## Practise Workbook - Pandas

In [1]:
import pandas as pd

In [2]:
student = ['Varun', 'Vedant', 'Eshan']
pd.Series(student)

0     Varun
1    Vedant
2     Eshan
dtype: object

In [3]:
student_course = {'Varun': 'English',
                  'Vedant': 'Computer-Science',
                  'Eshan': 'Data-Science'
                 }
s = pd.Series(student_course)

In [4]:
s.index

Index(['Varun', 'Vedant', 'Eshan'], dtype='object')

In [5]:
numbers = [1, 2, 3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [6]:
names = [('Varun', 'More'),('Vedant', 'More'), ('Prathamesh', 'Ghatole')]
s1 =  pd.Series(names)
s1

0            (Varun, More)
1           (Vedant, More)
2    (Prathamesh, Ghatole)
dtype: object

In [7]:
s2 = pd.Series(['Varun', 'Rudraksh', 'Devang'], index= ['Machine-Learning', 'Data-Science', 'Computer-Science'])
s2

Machine-Learning       Varun
Data-Science        Rudraksh
Computer-Science      Devang
dtype: object

 **None vs NaN** -

If we create a list of numbers, integers, or floats and put it in a None type, pandas automatically converts this into a special floating-point value designated as NaN which stands for Not a Number.

In [8]:
student = ['Varun', 'Vedant', None]
pd.Series(student)

0     Varun
1    Vedant
2      None
dtype: object

In [9]:
numbers = [1, 2, None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In above code sample third value is different value and pandas set the dtype to this series a floating point numbers instead of an object.

Pandas represent NaN as a floating point number and because all integers can type cast to float pandas type casted all the intergers to float.

In [10]:
import numpy as np

np.nan == None

False

In [11]:
np.nan == np.nan

False

In [12]:
#We use special function to test for the presence of (NaN) Not a Number such as the Numpy library isnan() function.
np.isnan(np.nan)

True

In [13]:
players = {
    'Varun':'Hockey',
    'Eshan':'Basketball',
    'Devang': 'Criket'
}
pd.Series(players, index = ['Varun', 'Eshan','Rudraksh'])

Varun           Hockey
Eshan       Basketball
Rudraksh           NaN
dtype: object

### Why Pandas? 
- **Simple to use.**
- **Integrated with many other data science and ML Python tools.**
- **Helps you get your data ready for machine learning.**

### 2 main types datatypes

In [14]:
# Series; are 1-dimensional 
series = pd.Series(['Honda','BMW','Toyota'])

In [15]:
series

0     Honda
1       BMW
2    Toyota
dtype: object

In [16]:
colours = pd.Series(['Red','Blue','Orange'])
colours

0       Red
1      Blue
2    Orange
dtype: object

In [17]:
#Dataframe; are 2-dimensional 
car_data = pd.DataFrame({'Car make':series, 'Colour': colours})
car_data

  Car make  Colour
0    Honda     Red
1      BMW    Blue
2   Toyota  Orange

In [27]:
#Importing Data.
dataset = pd.read_csv('https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/heart-disease.csv')
dataset

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [28]:
#Exporting Dataset.
dataset.to_csv('../source/exported-heart-disease-dataset', index = False)

In [30]:
dataset = pd.read_csv('../source/exported-heart-disease-dataset')
dataset

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

### Describeing Data

In [37]:
car_sales = pd.read_csv("https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [44]:
car_sales.to_csv("../source/car_sales.csv", index=False)

In [45]:
car_sales_dataset = pd.read_csv("../source/car_sales.csv")
car_sales_dataset

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [46]:
car_sales_dataset.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [49]:
car_columns = car_sales_dataset.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [50]:
car_index = car_sales_dataset.index

In [51]:
car_index

RangeIndex(start=0, stop=10, step=1)

In [52]:
car_sales_dataset

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [53]:
car_sales_dataset.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [54]:
car_sales_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [55]:
car_sales_dataset.mean()

/tmp/ipykernel_40005/3540865001.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  car_sales_dataset.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [56]:
car_prices = pd.Series([12000, 12302, 2202])

In [57]:
car_prices.mean()

8834.666666666666

In [62]:
len(car_sales_dataset)

10

### Viewing and Selecting Data.

In [63]:
car_sales_dataset.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [64]:
car_sales_dataset.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [65]:
#.iloc and loc function 
animals = pd.Series(['cat', 'dog', 'bird','panda','snake'], index =[0,3,9,8,3])

In [66]:
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [67]:
animals.loc[3] #loc refers to index

3      dog
3    snake
dtype: object

In [72]:
animals.iloc[3] #iloc refers to postion

'panda'

In [73]:
car_sales_dataset.iloc[:3]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [70]:
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [74]:
animals.iloc[3] #iloc refers to postion

'panda'

In [79]:
car_sales_dataset.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [78]:
car_sales_dataset["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [81]:
car_sales_dataset[car_sales_dataset["Make"]== "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [87]:
car_sales_dataset[car_sales_dataset["Odometer (KM)"]>100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00